Revit 2027 API
StructuralSectionLProfileWithLips Constructor
 Creates a new instance of Structural Section L Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionLProfileWithLips(
	double width,
	double height,
	double wallNominalThickness,
	double wallDesignThickness,
	double innerFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double lipLength
)
Public Sub New (
	width As Double,
	height As Double,
	wallNominalThickness As Double,
	wallDesignThickness As Double,
	innerFillet As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	principalAxesAngle As Double,
	sectionArea As Double,
	perimeter As Double,
	nominalWeight As Double,
	momentOfInertiaStrongAxis As Double,
	momentOfInertiaWeakAxis As Double,
	elasticModulusStrongAxis As Double,
	elasticModulusWeakAxis As Double,
	plasticModulusStrongAxis As Double,
	plasticModulusWeakAxis As Double,
	torsionalMomentOfInertia As Double,
	torsionalModulus As Double,
	warpingConstant As Double,
	shearAreaStrongAxis As Double,
	shearAreaWeakAxis As Double,
	lipLength As Double
)
public:
StructuralSectionLProfileWithLips(
	double width,
	double height,
	double wallNominalThickness,
	double wallDesignThickness,
	double innerFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double lipLength
)
new :
        width : float *
        height : float *
        wallNominalThickness : float *
        wallDesignThickness : float *
        innerFillet : float *
        centroidHorizontal : float *
        centroidVertical : float *
        principalAxesAngle : float *
        sectionArea : float *
        perimeter : float *
        nominalWeight : float *
        momentOfInertiaStrongAxis : float *
        momentOfInertiaWeakAxis : float *
        elasticModulusStrongAxis : float *
        elasticModulusWeakAxis : float *
        plasticModulusStrongAxis : float *
        plasticModulusWeakAxis : float *
        torsionalMomentOfInertia : float *
        torsionalModulus : float *
        warpingConstant : float *
        shearAreaStrongAxis : float *
        shearAreaWeakAxis : float *
        lipLength : float -> StructuralSectionLProfileWithLips
Parameters
width Double
 Section width.
height Double
 Section height, depth.
wallNominalThickness Double
 Represents wall nominal thickness of rectangle.
wallDesignThickness Double
 Represents wall design thickness of rectangle.
innerFillet Double
 Inner Fillet - Corner fillet inner radius.
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle Double
 Rotation angle between the principal axes and cross section reference planes.
sectionArea Double
 Cross section area.
perimeter Double
 Painting surface of the unit length.
nominalWeight Double
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis Double
 Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis Double
 Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis Double
 Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis Double
 Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis Double
 Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis Double
 Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia Double
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus Double
 Section modulus for calculations of torsion stresses (Ct)
warpingConstant Double
 Warping constant (Cw, Iomega, H)
shearAreaStrongAxis Double
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis Double
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
lipLength Double
 Lip segment length.
See Also
Reference
StructuralSectionLProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace